app/views/listings/show.html.erb

SELECT  "bids".* FROM "bids" WHERE "bids"."listing_id" = $1  ORDER BY "bids"."id" DESC LIMIT 1  [["listing_id", 55]]
SELECT COUNT(*) FROM "bids" WHERE "bids"."listing_id" = $1  [["listing_id", 58]]
---
    <br/><br/>
    <h2>Bid count: <b><%= @listing.bids.count %></b></h2>

SELECT "bids"."user_id" FROM "bids" WHERE "bids"."listing_id" = $1  [["listing_id", 1]]
SELECT COUNT(*) FROM "bids" WHERE "bids"."user_id" = $1 AND "bids"."listing_id" = $2  [["user_id", 17], ["listing_id", 1]]
---
      <tbody>
        <% @listing.bids.pluck(:user_id).uniq.each_with_index do |user_id, idx| %>
          <tr>
            <td><%= idx + 1 %>. <%= link_to User.find(user_id).name, user_path(user_id) %>: Bid count: <%= User.find(user_id).bids.where(listing_id: @listing.id).count %></td>