app/controllers/bids_controller.rb

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "bids" ("listing_id", "user_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["listing_id", 55], ["user_id", 32], ["amount", 200], ["created_at", "2015-06-24 19:10:03.583324"], ["updated_at", "2015-06-24 19:10:03.583324"]]
---
  def create
    @listing = Listing.find(params[:listing_id])
    @bid = @listing.bids.build bid_params
    if params && @bid.save

DELETE FROM "bids" WHERE "bids"."id" = $1  [["id", 92]]
---
  def destroy
    @bid.destroy

SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT 1  [["id", nil]]
---
  def set_bid
    @bid = Bid.find(params[:id])