app/controllers/listings_controller.rb

  def create
    @listing  = Listing.new listing_params
    ## collect data from JQuery datepicker and convert to valid Ruby DateTime object
    @listing.end_time    = parse_time(params[:listing][:end_time])
    @listing.start_time  = parse_time(params[:listing][:start_time])
    @listing.condition   = convert_condition(params[:listing][:condition])
    if @listing.save
---
INSERT INTO "listings" ("title", "description", "condition", "user_id", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def show
    @bid = @listing.bids.build
    @bids = @listing.bids.all
---
SELECT  "bids".* FROM "bids" WHERE "bids"."listing_id" = $1  ORDER BY "bids"."id" DESC LIMIT 1  [["listing_id", 55]]

  def index
    @listings = Listing.paginate(page: params[:page], :per_page => 15).order("end_time ASC")
---
SELECT  "listings".* FROM "listings"  ORDER BY end_time ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "listings"