app/controllers/sessions_controller.rb

  def login
    user = User.find_by(name: user_params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT 1  [["name", "Tgold"]]