app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new user_params
    if @user.save

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = $1  [["user_id", 22]]
SELECT "bids".* FROM "bids" WHERE "bids"."user_id" = $1  [["user_id", 28]]
---
  def show
    @listings = @user.listings.all
    @bids = @user.bids.all